[{"id": "682e030b7bb7ee2d5bf70968", "candidate_name": "Adelodun Abraham\nBackend Engineer", "text": "Adelodun Abraham\nBackend Engineer\n+2349018940521 ◇ab.adelodun@gmail.com ◇Nigeria ◇LinkedIn ◇GitHub\nSUMMARY\nBackend engineer with 2 years of building and deploying FastAPI microservices, monoliths, data pipelines, and secure\ntransaction systems. Expert at containerization, API design, database modeling, and third-party integrations. Proven track\nrecord delivering scalable, maintainable, production-grade backends.\nEXPERIENCE\nFounder/Backend Engineer\nLewa\nOgun State, Nigeria\nBuilt parametric insurance backend with FastAPI, integrating IoT sensor feeds, satellite data, and OpenWeather API to\ntrigger automated payouts.\nDesigned SQLAlchemy models and PostgreSQL schema supporting dynamic policy definitions and real-time claim\nprocessing.\nBackend Engineer\nBluelink SPS\nOta, Ogun State, Nigeria (Remote)\nDeveloped FastAPI backend for P2P escrow, ensuring 99.9% uptime and secure handling of ₦10M+ monthly transactions.\nBackend/ML Engineer\nVendlie\nDeveloped FastAPI endpoints for an AI-driven social commerce platform, merging Instagram-like feeds with Jumia\ne‑commerce.\nEngineered hybrid recommendation engine (collaborative + content-based + sentiment analysis) packaged as a PyPI\nmodule, boosting user engagement by 25%.\nBackend Intern\nTerntribe\nJan '25 — Mar '25\nLagos, Nigeria, Nigeria\nDeveloped RESTful services using Node.js, TypeScript, and PostgreSQL 9.x to support NGO-focused features\nUtilize tools like GitHub, and Slack to manage workflows, streamline collaboration, and deliver tasks within strict\ndeadlines\nEDUCATION\nBsc in Computer Science, Covenant University (GPA: First Class | Grade: 4.96/5.0)\nSep '23 — Present\nOta, Ogun State, Nigeria\nDevelops skills like programming, cybersecurity, and critical thinking.\nPROJECTS\nWeather Data Pipeline API\nJan '25\nEnd-to-end ETL pipeline that ingests, cleans, normalizes, and stores multi-source weather data, exposing analytics\nendpoints for front-end dashboards.\nBible Passage Finder\nAn AI-powered tool that converts streamed sermon audio into text, identifies Bible references, and integrates\nseamlessly with presentation software to display the corresponding verses.\nSmart Farm API\nReal-time IoT microservice enabling bidirectional communication between farm sensors and actuators.\nSKILLS\nProgramming Languages\nPython, Javascript, SQL, TypeScript, C, C++\nWeb Development\nFastAPI, HTML/CSS, Django, Node.js, Express, React.js\nSoft Skills\nTeam Collaboration, Problem Solving, Adaptability, Communication, Attention to Detail\nVOLUNTEER EXPERIENCE\nTechnical Crew Member\nManaged technical setups for university events, ensuring smooth operations.\nEnactus Student Member\nAdvocated for sustainability and environmental awareness through impactful initiatives.\nOpen-Source Contributer, Terntribe\nDevelop open-source solutions to improve the standard of living of Nigeria.\n"}]